
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

ef=[15,20,50,100,150]

a=[190776.92985534668,
198897.12810516357,
195067.91472434998,
391398.4866142273,
585251.6288757324]

b=[151147.07612991333,
 152076.91526412964,
 152390.02418518066,
 302315.58537483215,
 450316.29276275635]

c=[109890.28310775757,
106491.62769317627,
108221.48704528809,
205458.27770233154,
289599.44581985474]

d=[109856.8103313446 ,
110349.64179992676,
109847.85151481628,
201836.67707443237,
289253.1156539917]


data = [a,b,c,d]

相同ef各个分区构建开销
一幅图

同一分区随ef总体变化开销


def pic2(y1,y2,png):
    x = range(len(y1))
    fig = plt.figure(figsize=(5.5,4.2),dpi=100)
    # 添加Axes坐标轴实例，创建1个画板
    ax = fig.add_subplot(111)  
    # 制作第一条折现
    l = []
    for i in range(len(y1)):
        plt.plot(y1[i],y2[i])
    # 增加网格线
    #ax.grid()
    plt.savefig(png)

